indexxue/TM4C123GH6PM/Common/src/nvs.c
/**
 * @file    nvs.c
 * @brief   NVS 页式 KV、配置缓存与参数访问策略
 */

#include "nvs.h"

#include "device_profile.h"
#include "encoder_polarity.h"
#include "crc32.h"
#include "flash_layout.h"

#include "driverlib/flash.h"
#include "driverlib/interrupt.h"

#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"

#if defined(NVS_RTOS_LOCK)
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"

#include "bsp_uart.h"
#endif

#include <stddef.h>
#include <string.h>

/* -------------------------------------------------------------------------- */
/* 页 / 记录内部结构                                                            */
/* -------------------------------------------------------------------------- */

typedef struct {
    uint32_t magic;
    uint32_t version;
    uint32_t seq;
    uint32_t hdr_crc32;
} nvs_page_hdr_t;

typedef struct {
    uint32_t magic;
    uint32_t crc32;
    uint16_t ns_len;
    uint16_t key_len;
    uint16_t val_len;
    uint16_t reserved;
} nvs_rec_hdr_t;

#define NVS_REC_MAGIC 0x52454331U   /* "REC1" */

#define NVS_SRC_FACTORY   (1U << NVS_WRITE_SRC_FACTORY)
#define NVS_SRC_CMD        (1U << NVS_WRITE_SRC_CMD)
#define NVS_SRC_PROTOCOL   (1U << NVS_WRITE_SRC_PROTOCOL)
#define NVS_SRC_INTERNAL   (1U << NVS_WRITE_SRC_INTERNAL)

typedef struct {
    u8_t persist;
    u8_t write_mask;
} nvs_param_policy_t;

static uint32_t s_active_page;
static nvs_cfg_t s_cfg;
static int s_first_boot;
static uint8_t s_nvs_payload[NVS_PAGE_SIZE - NVS_PAGE_HDR_SIZE] __attribute__((aligned(4)));
static uint8_t s_boot_rsvd_copy[NVS_BOOT_RSVD_SIZE] __attribute__((aligned(4)));
static int s_boot_rsvd_override;

#if defined(NVS_RTOS_LOCK)
static SemaphoreHandle_t s_nvs_mu;
#endif

static void nvs_lock(void)
{
#if defined(NVS_RTOS_LOCK)
    if (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING) {
        if (s_nvs_mu == NULL) {
            s_nvs_mu = xSemaphoreCreateMutex();
            if (s_nvs_mu == NULL) {
                bsp_uart_debug_puts("[nvs] mutex create failed\r\n");
            }
        }
        if (s_nvs_mu != NULL) {
            (void)xSemaphoreTake(s_nvs_mu, portMAX_DELAY);
        }
    }
#else
    /* no-op */
#endif
}

static void nvs_unlock(void)
{
#if defined(NVS_RTOS_LOCK)
    if ((s_nvs_mu != NULL) && (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING)) {
        (void)xSemaphoreGive(s_nvs_mu);
    }
#else
    /* no-op */
#endif
}

static status_t nvs_param_persist_u32(nvs_param_id_t id, const char *ns, const char *key, u32_t value);
static status_t nvs_get_u32_impl(const char *ns, const char *key, u32_t *value);
static void nvs_cfg_apply_defaults(nvs_cfg_t *cfg);
static void nvs_cfg_reconcile_encoder_dir(nvs_cfg_t *cfg);
static void nvs_cfg_reconcile_motor_dir(nvs_cfg_t *cfg);
static void nvs_cfg_load_from_flash(nvs_cfg_t *cfg);
static void nvs_cfg_detect_first_boot(void);
static status_t nvs_cfg_seed_if_needed(void);
static void nvs_flash_scheduler_guard_begin(int *suspended);
static void nvs_flash_scheduler_guard_end(int suspended);
static void nvs_cfg_ensure_serial(void);
static int nvs_load_blob_exact(const char *ns, const char *key, void *dst, u32_t expect_len);
static void nvs_dev_fill_serial(char *serial, size_t size);

static const nvs_param_policy_t s_param_policy[NVS_PARAM_COUNT] = {
    [NVS_PARAM_SCHEMA] = {1U, NVS_SRC_INTERNAL},
    [NVS_PARAM_SERIAL] = {1U, NVS_SRC_FACTORY},
    [NVS_PARAM_HW_REV] = {1U, NVS_SRC_FACTORY},
    [NVS_PARAM_BOOT_COUNT] = {1U, NVS_SRC_INTERNAL},
    [NVS_PARAM_FW_VERSION] = {1U, NVS_SRC_FACTORY | NVS_SRC_CMD | NVS_SRC_PROTOCOL | NVS_SRC_INTERNAL},
    [NVS_PARAM_PID_SPEED] = {0U, NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_PID_LINE] = {0U, NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_SPD_LIMIT] = {1U, NVS_SRC_FACTORY | NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_KINEMATICS] = {1U, NVS_SRC_FACTORY | NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_MOTOR_DIR] = {1U, NVS_SRC_FACTORY | NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_IMU_OFFSET] = {1U, NVS_SRC_FACTORY | NVS_SRC_PROTOCOL},
    [NVS_PARAM_LINE_THRESHOLD] = {1U, NVS_SRC_FACTORY | NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_ENCODER_ZERO] = {1U, NVS_SRC_FACTORY | NVS_SRC_PROTOCOL},
    [NVS_PARAM_BATTERY_CAL] = {1U, NVS_SRC_FACTORY | NVS_SRC_PROTOCOL},
    [NVS_PARAM_LAST_MODE] = {1U, NVS_SRC_INTERNAL},
    [NVS_PARAM_ENCODER_DIR] = {1U, NVS_SRC_FACTORY | NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_PID_YAW] = {0U, NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_MAG_HEADING] = {1U, NVS_SRC_FACTORY | NVS_SRC_PROTOCOL},
    [NVS_PARAM_PID_DIST] = {0U, NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_LINE_POLARITY] = {1U, NVS_SRC_FACTORY | NVS_SRC_CMD | NVS_SRC_PROTOCOL},
    [NVS_PARAM_LINE_BASE_RPM] = {1U, NVS_SRC_FACTORY | NVS_SRC_CMD | NVS_SRC_PROTOCOL},
};

/* -------------------------------------------------------------------------- */
/* Flash 范围检查                                                             */
/* -------------------------------------------------------------------------- */

static status_t nvs_flash_check_range(uint32_t address, uint32_t length, nvs_flash_allow_t allow)
{
    uint32_t end;

    if (length == 0U) {
        return STATUS_INVALID_ARG;
    }

    if ((address % FLASH_PROGRAM_ALIGN) != 0U) {
        return STATUS_INVALID_ARG;
    }

    if ((length % FLASH_PROGRAM_ALIGN) != 0U) {
        return STATUS_INVALID_ARG;
    }

    end = address + length - 1U;
    if (end < address) {
        return STATUS_INVALID_ARG;
    }

    if (flash_addr_in_range(address, FLASH_BL_BASE, FLASH_BL_SIZE) ||
        flash_addr_in_range(end, FLASH_BL_BASE, FLASH_BL_SIZE)) {
        return STATUS_INVALID_ARG;
    }

    if (flash_addr_in_range(address, FLASH_APP_A_BASE, FLASH_APP_A_SIZE) ||
        flash_addr_in_range(end, FLASH_APP_A_BASE, FLASH_APP_A_SIZE)) {
        return STATUS_INVALID_ARG;
    }

    if ((allow & NVS_FLASH_ALLOW_NVS) != 0U) {
        if (flash_addr_in_range(address, FLASH_NVS_BASE, FLASH_NVS_SIZE) &&
            flash_addr_in_range(end, FLASH_NVS_BASE, FLASH_NVS_SIZE)) {
            return STATUS_OK;
        }
    }

    return STATUS_INVALID_ARG;
}

static void nvs_flash_scheduler_guard_begin(int *suspended)
{
    *suspended = 0;

#if defined(NVS_RTOS_LOCK)
    if (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING) {
        vTaskSuspendAll();
        *suspended = 1;
    }
#else
    (void)suspended;
#endif
}

static void nvs_flash_scheduler_guard_end(int suspended)
{
#if defined(NVS_RTOS_LOCK)
    if (suspended != 0) {
        (void)xTaskResumeAll();
    }
#else
    (void)suspended;
#endif
}

status_t nvs_flash_erase(uint32_t address, uint32_t length, nvs_flash_allow_t allow)
{
    uint32_t offset;
    int32_t rc;
    int suspended;

    if (nvs_flash_check_range(address, length, allow) != STATUS_OK) {
        return STATUS_INVALID_ARG;
    }

    nvs_flash_scheduler_guard_begin(&suspended);

    for (offset = 0U; offset < length; offset += FLASH_ERASE_BLOCK_SIZE) {
        uint32_t block_addr = address + offset;

        IntMasterDisable();
        rc = FlashErase(block_addr);
        IntMasterEnable();

        if (rc != 0) {
            nvs_flash_scheduler_guard_end(suspended);
            return STATUS_FAIL;
        }
    }

    nvs_flash_scheduler_guard_end(suspended);
    return STATUS_OK;
}

status_t nvs_flash_program(uint32_t address, const void *data, uint32_t length,
                           nvs_flash_allow_t allow)
{
    int32_t rc;
    const uint32_t *words;
    int suspended;

    if ((data == NULL) || (length == 0U)) {
        return STATUS_INVALID_ARG;
    }

    if (nvs_flash_check_range(address, length, allow) != STATUS_OK) {
        return STATUS_INVALID_ARG;
    }

