indexxue/TM4C123GH6PM/Common/src/nvs.c
    if ((length % FLASH_PROGRAM_ALIGN) != 0U) {
        return STATUS_INVALID_ARG;
    }

    words = (const uint32_t *)data;

    nvs_flash_scheduler_guard_begin(&suspended);

    IntMasterDisable();
    rc = FlashProgram((uint32_t *)words, address, length);
    IntMasterEnable();

    nvs_flash_scheduler_guard_end(suspended);

    return (rc == 0) ? STATUS_OK : STATUS_FAIL;
}

/* -------------------------------------------------------------------------- */
/* 页式 KV                                                                     */
/* -------------------------------------------------------------------------- */

static uint32_t nvs_page_base(uint32_t page_index)
{
    return FLASH_NVS_BASE + (page_index * NVS_PAGE_SIZE);
}

static uint32_t nvs_hdr_crc(const nvs_page_hdr_t *hdr)
{
    uint32_t crc = CRC32_INIT_VALUE;
    crc = crc32_update(crc, &hdr->magic, sizeof(hdr->magic));
    crc = crc32_update(crc, &hdr->version, sizeof(hdr->version));
    crc = crc32_update(crc, &hdr->seq, sizeof(hdr->seq));
    return crc32_finalize(crc);
}

static int nvs_page_hdr_valid(const nvs_page_hdr_t *hdr)
{
    if (hdr->magic != NVS_PAGE_MAGIC) {
        return 0;
    }
    if (hdr->version != NVS_PAGE_VERSION) {
        return 0;
    }
    if (hdr->hdr_crc32 != nvs_hdr_crc(hdr)) {
        return 0;
    }
    return 1;
}

static int nvs_page_erased(const nvs_page_hdr_t *hdr)
{
    const uint8_t *p = (const uint8_t *)hdr;
    uint32_t i;

    for (i = 0U; i < sizeof(nvs_page_hdr_t); i++) {
        if (p[i] != 0xFFU) {
            return 0;
        }
    }
    return 1;
}

static uint32_t nvs_align4(uint32_t v)
{
    return (v + 3U) & ~3U;
}

static uint32_t nvs_record_total_len(const nvs_rec_hdr_t *rh)
{
    return sizeof(nvs_rec_hdr_t) + nvs_align4(rh->ns_len) + nvs_align4(rh->key_len) +
           nvs_align4(rh->val_len);
}

static int nvs_record_crc_valid(const uint8_t *rec_base, uint32_t rec_total)
{
    uint8_t scratch[256U];
    nvs_rec_hdr_t *rh;
    uint32_t stored_crc;
    uint32_t computed_crc;

    if (rec_total > sizeof(scratch)) {
        return 0;
    }

    (void)memcpy(scratch, rec_base, rec_total);
    rh = (nvs_rec_hdr_t *)scratch;
    stored_crc = rh->crc32;
    rh->crc32 = 0U;
    computed_crc = crc32_compute(scratch, rec_total);

    return (computed_crc == stored_crc) ? 1 : 0;
}

static status_t nvs_program_words(uint32_t address, const void *data, uint32_t len)
{
    return nvs_flash_program(address, data, len, NVS_FLASH_ALLOW_NVS);
}

static status_t nvs_erase_page(uint32_t page_index)
{
    return nvs_flash_erase(nvs_page_base(page_index), NVS_PAGE_SIZE, NVS_FLASH_ALLOW_NVS);
}

static status_t nvs_write_page_header(uint32_t page_index, uint32_t seq)
{
    nvs_page_hdr_t hdr;

    hdr.magic = NVS_PAGE_MAGIC;
    hdr.version = NVS_PAGE_VERSION;
    hdr.seq = seq;
    hdr.hdr_crc32 = nvs_hdr_crc(&hdr);

    return nvs_program_words(nvs_page_base(page_index), &hdr, sizeof(hdr));
}

static status_t nvs_scan_pages(void)
{
    uint32_t i;
    uint32_t best = 0U;
    int found = 0;

    for (i = 0U; i < NVS_PAGE_COUNT; i++) {
        const nvs_page_hdr_t *hdr = (const nvs_page_hdr_t *)nvs_page_base(i);

        if (nvs_page_erased(hdr)) {
            continue;
        }
        if (nvs_page_hdr_valid(hdr) == 0) {
            continue;
        }
        if ((found == 0) || (hdr->seq >= best)) {
            best = hdr->seq;
            s_active_page = i;
            found = 1;
        }
    }

    if (found == 0) {
        s_active_page = 0U;
        if (nvs_erase_page(0U) != STATUS_OK) {
            return STATUS_FAIL;
        }
        if (nvs_write_page_header(0U, 0U) != STATUS_OK) {
            return STATUS_FAIL;
        }
    }

    return STATUS_OK;
}

static status_t nvs_find_record(const char *ns, const char *key, uint32_t *offset_out,
                                nvs_rec_hdr_t *hdr_out)
{
    uint32_t offset = NVS_DATA_OFFSET;
    const uint8_t *page = (const uint8_t *)nvs_page_base(s_active_page);
    size_t ns_len = strlen(ns);
    size_t key_len = strlen(key);

    if ((ns_len == 0U) || (ns_len >= NVS_NS_MAX) || (key_len == 0U) || (key_len >= NVS_KEY_MAX)) {
        return STATUS_INVALID_ARG;
    }

    while ((offset + sizeof(nvs_rec_hdr_t)) <= NVS_PAGE_SIZE) {
        const nvs_rec_hdr_t *rh = (const nvs_rec_hdr_t *)(page + offset);
        uint32_t rec_total;

        if (rh->magic == 0xFFFFFFFFU) {
            break;
        }
        if (rh->magic != NVS_REC_MAGIC) {
            return STATUS_FAIL;
        }

        rec_total = nvs_record_total_len(rh);
        if ((offset + rec_total) > NVS_PAGE_SIZE) {
            return STATUS_FAIL;
        }

        if (nvs_record_crc_valid(page + offset, rec_total) == 0) {
            return STATUS_FAIL;
        }

        if ((rh->ns_len == ns_len) && (rh->key_len == key_len)) {
            const char *rec_ns = (const char *)(page + offset + sizeof(nvs_rec_hdr_t));
            const char *rec_key = rec_ns + nvs_align4(rh->ns_len);

            if ((strncmp(rec_ns, ns, ns_len) == 0) && (strncmp(rec_key, key, key_len) == 0)) {
                if (offset_out != NULL) {
                    *offset_out = offset;
                }
                if (hdr_out != NULL) {
                    *hdr_out = *rh;
                }
                return STATUS_OK;
            }
        }

        offset += rec_total;
    }

    return STATUS_FAIL;
}

static status_t nvs_build_page_payload(uint8_t *buf, uint32_t buf_size, uint32_t *out_len,
                                       const char *ns, const char *key, const void *val,
                                       uint32_t val_len, int replace)
{
    uint32_t dst = 0U;
    uint32_t src = NVS_DATA_OFFSET;
    const uint8_t *page = (const uint8_t *)nvs_page_base(s_active_page);
    size_t ns_len = strlen(ns);
    size_t key_len = strlen(key);

    if ((ns_len == 0U) || (ns_len >= NVS_NS_MAX) || (key_len == 0U) || (key_len >= NVS_KEY_MAX) ||
        (val_len > NVS_BLOB_MAX)) {
        return STATUS_INVALID_ARG;
    }

    while (src < NVS_PAGE_SIZE) {
        const nvs_rec_hdr_t *rh = (const nvs_rec_hdr_t *)(page + src);
        uint32_t rec_total;

        if (rh->magic == 0xFFFFFFFFU) {
            break;
        }
        if (rh->magic != NVS_REC_MAGIC) {
            return STATUS_FAIL;
        }

        rec_total = nvs_record_total_len(rh);
        if ((src + rec_total) > NVS_PAGE_SIZE) {
            return STATUS_FAIL;
        }

        if (nvs_record_crc_valid(page + src, rec_total) == 0) {
            return STATUS_FAIL;
        }

        if (replace != 0) {
            const char *rec_ns = (const char *)(page + src + sizeof(nvs_rec_hdr_t));
            const char *rec_key = rec_ns + nvs_align4(rh->ns_len);

            if ((rh->ns_len == ns_len) && (rh->key_len == key_len) &&
                (strncmp(rec_ns, ns, ns_len) == 0) && (strncmp(rec_key, key, key_len) == 0)) {
                src += rec_total;
                continue;
            }
        }

        if ((dst + rec_total) > buf_size) {
            return STATUS_NO_MEM;
        }
        memcpy(buf + dst, page + src, rec_total);
        dst += rec_total;
        src += rec_total;
    }

    {
        nvs_rec_hdr_t rh;
        uint32_t rec_total = (uint32_t)(sizeof(nvs_rec_hdr_t) + nvs_align4((uint32_t)ns_len) +
                                        nvs_align4((uint32_t)key_len) + nvs_align4(val_len));

        if ((dst + rec_total) > buf_size) {
            return STATUS_NO_MEM;
        }

