indexxue/TM4C123GH6PM/Common/src/nvs.c
        rh.magic = NVS_REC_MAGIC;
        rh.ns_len = (uint16_t)ns_len;
        rh.key_len = (uint16_t)key_len;
        rh.val_len = (uint16_t)val_len;
        rh.reserved = 0U;
        rh.crc32 = 0U;

        memcpy(buf + dst, &rh, sizeof(rh));
        dst += sizeof(rh);
        memcpy(buf + dst, ns, ns_len);
        {
            uint32_t ns_pad = nvs_align4((uint32_t)ns_len);
            if (ns_pad > (uint32_t)ns_len) {
                (void)memset(buf + dst + ns_len, 0, ns_pad - (uint32_t)ns_len);
            }
            dst += ns_pad;
        }
        memcpy(buf + dst, key, key_len);
        {
            uint32_t key_pad = nvs_align4((uint32_t)key_len);
            if (key_pad > (uint32_t)key_len) {
                (void)memset(buf + dst + key_len, 0, key_pad - (uint32_t)key_len);
            }
            dst += key_pad;
        }
        {
            uint32_t val_base = dst;

            if (val_len > 0U) {
                memcpy(buf + dst, val, val_len);
            }
            {
                uint32_t val_pad = nvs_align4(val_len);
                if (val_pad > val_len) {
                    (void)memset(buf + val_base + val_len, 0, val_pad - val_len);
                }
                dst = val_base + val_pad;
            }
        }

        {
            uint32_t rec_base = dst - rec_total;
            uint32_t crc = crc32_compute(buf + rec_base, rec_total);
            memcpy(buf + rec_base + offsetof(nvs_rec_hdr_t, crc32), &crc, sizeof(crc));
        }
    }

    *out_len = dst;
    return STATUS_OK;
}

static status_t nvs_append_record(uint8_t *buf, uint32_t buf_size, uint32_t *dst, const char *ns,
                                  const char *key, const void *val, uint32_t val_len)
{
    size_t ns_len = strlen(ns);
    size_t key_len = strlen(key);
    nvs_rec_hdr_t rh;
    uint32_t rec_total;
    uint32_t rec_base;
    uint32_t crc;

    if ((ns_len == 0U) || (ns_len >= NVS_NS_MAX) || (key_len == 0U) || (key_len >= NVS_KEY_MAX) ||
        (val_len > NVS_BLOB_MAX)) {
        return STATUS_INVALID_ARG;
    }

    rec_total = (uint32_t)(sizeof(nvs_rec_hdr_t) + nvs_align4((uint32_t)ns_len) +
                           nvs_align4((uint32_t)key_len) + nvs_align4(val_len));
    if ((*dst + rec_total) > buf_size) {
        return STATUS_NO_MEM;
    }

    rec_base = *dst;
    rh.magic = NVS_REC_MAGIC;
    rh.ns_len = (uint16_t)ns_len;
    rh.key_len = (uint16_t)key_len;
    rh.val_len = (uint16_t)val_len;
    rh.reserved = 0U;
    rh.crc32 = 0U;

    (void)memcpy(buf + *dst, &rh, sizeof(rh));
    *dst += sizeof(rh);
    (void)memcpy(buf + *dst, ns, ns_len);
    {
        uint32_t ns_pad = nvs_align4((uint32_t)ns_len);
        if (ns_pad > (uint32_t)ns_len) {
            (void)memset(buf + *dst + ns_len, 0, ns_pad - (uint32_t)ns_len);
        }
        *dst += ns_pad;
    }
    (void)memcpy(buf + *dst, key, key_len);
    {
        uint32_t key_pad = nvs_align4((uint32_t)key_len);
        if (key_pad > (uint32_t)key_len) {
            (void)memset(buf + *dst + key_len, 0, key_pad - (uint32_t)key_len);
        }
        *dst += key_pad;
    }
    {
        uint32_t val_base = *dst;

        if (val_len > 0U) {
            (void)memcpy(buf + *dst, val, val_len);
        }
        {
            uint32_t val_pad = nvs_align4(val_len);
            if (val_pad > val_len) {
                (void)memset(buf + val_base + val_len, 0, val_pad - val_len);
            }
            *dst = val_base + val_pad;
        }
    }

    crc = crc32_compute(buf + rec_base, rec_total);
    (void)memcpy(buf + rec_base + offsetof(nvs_rec_hdr_t, crc32), &crc, sizeof(crc));
    return STATUS_OK;
}

static status_t nvs_copy_active_kv_payload(uint8_t *buf, uint32_t buf_size, uint32_t *out_len)
{
    uint32_t src = NVS_DATA_OFFSET;
    uint32_t dst = 0U;
    const uint8_t *page = (const uint8_t *)nvs_page_base(s_active_page);

    while (src < NVS_PAGE_SIZE) {
        const nvs_rec_hdr_t *rh = (const nvs_rec_hdr_t *)(page + src);
        uint32_t rec_total;

        if (rh->magic == 0xFFFFFFFFU) {
            break;
        }
        if (rh->magic != NVS_REC_MAGIC) {
            return STATUS_FAIL;
        }

        rec_total = nvs_record_total_len(rh);
        if ((src + rec_total) > NVS_PAGE_SIZE) {
            return STATUS_FAIL;
        }

        if (nvs_record_crc_valid(page + src, rec_total) == 0) {
            return STATUS_FAIL;
        }

        if ((dst + rec_total) > buf_size) {
            return STATUS_NO_MEM;
        }

        (void)memcpy(buf + dst, page + src, rec_total);
        dst += rec_total;
        src += rec_total;
    }

    *out_len = dst;
    return STATUS_OK;
}

static status_t nvs_commit_page_payload(const uint8_t *payload, uint32_t payload_len)
{
    uint32_t inactive;
    uint32_t next_seq;
    const nvs_page_hdr_t *active_hdr;
    status_t st;

    inactive = (s_active_page + 1U) % NVS_PAGE_COUNT;
    active_hdr = (const nvs_page_hdr_t *)nvs_page_base(s_active_page);
    next_seq = nvs_page_hdr_valid(active_hdr) ? (active_hdr->seq + 1U) : 0U;

    st = nvs_erase_page(inactive);
    if (st != STATUS_OK) {
        return st;
    }

    {
        const uint8_t *active = (const uint8_t *)nvs_page_base(s_active_page);

        if (s_boot_rsvd_override == 0) {
            (void)memcpy(s_boot_rsvd_copy, active + NVS_BOOT_RSVD_OFFSET, NVS_BOOT_RSVD_SIZE);
        }
        st = nvs_program_words(nvs_page_base(inactive) + NVS_BOOT_RSVD_OFFSET, s_boot_rsvd_copy,
                               NVS_BOOT_RSVD_SIZE);
        if (st != STATUS_OK) {
            return st;
        }
    }

    st = nvs_program_words(nvs_page_base(inactive) + NVS_DATA_OFFSET, payload, payload_len);
    if (st != STATUS_OK) {
        return st;
    }

    st = nvs_write_page_header(inactive, next_seq);
    if (st != STATUS_OK) {
        return st;
    }

    s_active_page = inactive;
    s_boot_rsvd_override = 0;
    return STATUS_OK;
}

static status_t nvs_put_record(const char *ns, const char *key, const void *val, uint32_t val_len,
                               int replace)
{
    uint32_t payload_len = 0U;
    status_t st;

