indexxue/TM4C123GH6PM/Common/src/nvs.c
    st = nvs_build_page_payload(s_nvs_payload, sizeof(s_nvs_payload), &payload_len, ns, key, val,
                                val_len, replace);
    if (st != STATUS_OK) {
        return st;
    }

    return nvs_commit_page_payload(s_nvs_payload, payload_len);
}

static status_t nvs_set_blob_impl(const char *ns, const char *key, const void *data, uint32_t len)
{
    nvs_rec_hdr_t existing;
    int replace = (nvs_find_record(ns, key, NULL, &existing) == STATUS_OK) ? 1 : 0;

    if ((data == NULL) && (len > 0U)) {
        return STATUS_INVALID_ARG;
    }

    return nvs_put_record(ns, key, data, len, replace);
}

static status_t nvs_get_blob_impl(const char *ns, const char *key, void *data, uint32_t *len_inout)
{
    nvs_rec_hdr_t rh;
    uint32_t offset;
    const uint8_t *page;
    const uint8_t *val;

    if ((key == NULL) || (len_inout == NULL)) {
        return STATUS_INVALID_ARG;
    }

    if (nvs_find_record(ns, key, &offset, &rh) != STATUS_OK) {
        return STATUS_FAIL;
    }

    page = (const uint8_t *)nvs_page_base(s_active_page);
    val = page + offset + sizeof(nvs_rec_hdr_t) + nvs_align4(rh.ns_len) + nvs_align4(rh.key_len);

    if (*len_inout < rh.val_len) {
        *len_inout = rh.val_len;
        return STATUS_NO_MEM;
    }

    if ((data != NULL) && (rh.val_len > 0U)) {
        memcpy(data, val, rh.val_len);
    }
    *len_inout = rh.val_len;
    return STATUS_OK;
}

status_t nvs_set_blob(const char *ns, const char *key, const void *data, uint32_t len)
{
    status_t st;

    nvs_lock();
    st = nvs_set_blob_impl(ns, key, data, len);
    nvs_unlock();
    return st;
}

status_t nvs_get_blob(const char *ns, const char *key, void *data, uint32_t *len_inout)
{
    status_t st;

    nvs_lock();
    st = nvs_get_blob_impl(ns, key, data, len_inout);
    nvs_unlock();
    return st;
}

status_t nvs_set_u32(const char *ns, const char *key, uint32_t value)
{
    return nvs_set_blob(ns, key, &value, sizeof(value));
}

status_t nvs_get_u32(const char *ns, const char *key, uint32_t *value)
{
    uint32_t len = sizeof(*value);

    if (value == NULL) {
        return STATUS_INVALID_ARG;
    }

    return nvs_get_blob(ns, key, value, &len);
}

status_t nvs_init(void)
{
    status_t st;

    nvs_lock();

    s_active_page = 0U;
    st = nvs_scan_pages();
    if (st != STATUS_OK) {
        nvs_unlock();
        return st;
    }

    nvs_cfg_apply_defaults(&s_cfg);
    nvs_cfg_load_from_flash(&s_cfg);
    nvs_cfg_detect_first_boot();

    if (s_cfg.serial[0] == '\0') {
        nvs_dev_fill_serial(s_cfg.serial, sizeof(s_cfg.serial));
    }

    if (s_cfg.fw_version[0] == '\0') {
        static const char s_fw_default[] = FW_VERSION_STR;
        size_t n = sizeof(s_fw_default) - 1U;

        if (n >= NVS_CFG_FW_VER_MAX) {
            n = NVS_CFG_FW_VER_MAX - 1U;
        }
        (void)memcpy(s_cfg.fw_version, s_fw_default, n);
        s_cfg.fw_version[n] = '\0';
    }

    if (s_cfg.boot_count < UINT32_MAX) {
        s_cfg.boot_count++;
    }

    nvs_unlock();
    return STATUS_OK;
}

status_t nvs_startup_finalize(void)
{
    u32_t schema = 0U;
    status_t st;
    int had_schema = (nvs_get_u32_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_SCHEMA, &schema) == STATUS_OK);

    if (!had_schema) {
        st = nvs_cfg_seed_if_needed();
        if (st != STATUS_OK) {
            return st;
        }
        nvs_cfg_ensure_serial();
        return STATUS_OK;
    }

    nvs_cfg_ensure_serial();

    /* 旧片上无 fw_ver 键时，把 RAM 默认版本落到 NVS，便于 HELLO / PARAM_READ */
    {
        char fw_probe[NVS_CFG_FW_VER_MAX];
        u32_t fw_probe_len = sizeof(fw_probe);

        if ((s_cfg.fw_version[0] != '\0') &&
            (nvs_get_blob_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_FW_VER, fw_probe, &fw_probe_len) !=
             STATUS_OK)) {
            (void)nvs_param_set_fw_version(s_cfg.fw_version, NVS_WRITE_SRC_INTERNAL);
        }
    }

    return nvs_param_persist_u32(NVS_PARAM_BOOT_COUNT, NVS_CFG_NS_DEV, NVS_CFG_KEY_BOOT_CNT,
                                 s_cfg.boot_count);
}

uint32_t nvs_active_page_index(void)
{
    return s_active_page;
}

void nvs_set_active_page_index(uint32_t page_index)
{
#if defined(NVS_CMD_RAW_KV)
    nvs_lock();
    if (page_index < NVS_PAGE_COUNT) {
        s_active_page = page_index;
    }
    nvs_unlock();
#else
    (void)page_index;
#endif
}

/* -------------------------------------------------------------------------- */
/* 配置默认值 / 加载                                                            */
/* -------------------------------------------------------------------------- */

static void nvs_cfg_apply_defaults(nvs_cfg_t *cfg)
{
    const device_product_profile_t *profile = device_profile_product();
    u32_t i;

    (void)memset(cfg, 0, sizeof(*cfg));

    cfg->schema_version = NVS_CFG_SCHEMA_VERSION;
    cfg->hw_rev = (profile->product_id == DEVICE_PRODUCT_ID_CAR_2WD_FULL)
                      ? NVS_HW_REV_CAR_2WD_V1
                      : NVS_HW_REV_CAR_4WD_V1;

    cfg->pid_speed.kp = 1.0f;
    cfg->pid_speed.ki = 0.20f;
    cfg->pid_speed.kd = 0.0f;
    cfg->pid_line.kp = 8.0f;
    cfg->pid_line.ki = 0.0f;
    cfg->pid_line.kd = 0.25f;
    cfg->pid_yaw.kp = 2.0f;
    cfg->pid_yaw.ki = 0.0f;
    cfg->pid_yaw.kd = 0.5f;
    cfg->pid_dist.kp = 0.8f;
    cfg->pid_dist.ki = 0.05f;
    cfg->pid_dist.kd = 0.02f;

    cfg->spd_limit.max_rpm = 300.0f;
    cfg->spd_limit.max_accel_rpm_s = 600.0f;

    cfg->kinematics.wheel_diam_m = 0.065f;
    cfg->kinematics.gear_ratio = 30.0f;
    cfg->kinematics.encoder_cpr = 11U;
    if (profile->product_id == DEVICE_PRODUCT_ID_CAR_2WD_FULL) {
        cfg->kinematics.track_width_m = 0.0f;
        cfg->kinematics.wheelbase_m = 0.16f;
    } else {
        cfg->kinematics.track_width_m = 0.18f;
        cfg->kinematics.wheelbase_m = 0.16f;
    }

    cfg->battery_cal.scale = 1.0f;
    cfg->battery_cal.offset_v = 0.0f;
    cfg->mag_heading_offset_deg = 0.0f;

    for (i = 0U; i < NVS_CFG_LINE_SENSOR_COUNT; i++) {
        cfg->line_threshold.threshold[i] = 2048U;
    }
    cfg->line_black_active_high = 1U; /* 默认高电平/高 ADC = 黑线 */
    cfg->line_base_rpm = 80.0f;

