indexxue/TM4C123GH6PM/Common/src/nvs.c
    cfg->last_mode = NVS_RUN_MODE_IDLE;
    {
        static const char s_fw_default[] = FW_VERSION_STR;
        size_t n = sizeof(s_fw_default) - 1U;

        if (n >= NVS_CFG_FW_VER_MAX) {
            n = NVS_CFG_FW_VER_MAX - 1U;
        }
        (void)memcpy(cfg->fw_version, s_fw_default, n);
        cfg->fw_version[n] = '\0';
    }

    /* 出厂 encoder_dir_mask / motor_dir_mask 由 encoder_polarity_board.h / encoder_polarity.h 决定 */
    cfg->encoder_dir_mask = encoder_polarity_default_mask();
    cfg->motor_dir_mask = motor_polarity_default_mask();
}

static void nvs_cfg_reconcile_encoder_dir(nvs_cfg_t *cfg)
{
    u32_t expected;

    if (cfg == NULL) {
        return;
    }

    expected = encoder_polarity_default_mask();
    /* 编码器极性是板级固定属性，全部以编译期默认值为准 */
    cfg->encoder_dir_mask = expected;
}

static void nvs_cfg_reconcile_motor_dir(nvs_cfg_t *cfg)
{
    u32_t expected;

    if (cfg == NULL) {
        return;
    }

    expected = motor_polarity_default_mask();
    /* 电机极性是板级固定属性（非用户偏好），全部以编译期默认值为准 */
    cfg->motor_dir_mask = expected;
}

static int nvs_load_blob_exact(const char *ns, const char *key, void *dst, u32_t expect_len)
{
    u32_t len = expect_len;

    if (nvs_get_blob_impl(ns, key, dst, &len) != STATUS_OK) {
        return 0;
    }
    if (len != expect_len) {
        return 0;
    }
    return 1;
}

static status_t nvs_get_u32_impl(const char *ns, const char *key, u32_t *value)
{
    u32_t len = sizeof(*value);

    if (value == NULL) {
        return STATUS_INVALID_ARG;
    }

    return nvs_get_blob_impl(ns, key, value, &len);
}

static status_t nvs_cfg_persist_defaults(void)
{
    uint32_t len = 0U;
    size_t serial_len;
    status_t st;

    nvs_dev_fill_serial(s_cfg.serial, sizeof(s_cfg.serial));
    serial_len = strlen(s_cfg.serial);

#define NVS_APPEND_U32(ns, key, value)                                              \
    do {                                                                            \
        u32_t _v = (value);                                                         \
        st = nvs_append_record(s_nvs_payload, sizeof(s_nvs_payload), &len, (ns),    \
                               (key), &_v, (u32_t)sizeof(_v));                      \
        if (st != STATUS_OK) {                                                      \
            return st;                                                              \
        }                                                                           \
    } while (0)

#define NVS_APPEND_BLOB(ns, key, ptr, size)                                         \
    do {                                                                            \
        st = nvs_append_record(s_nvs_payload, sizeof(s_nvs_payload), &len, (ns),    \
                               (key), (ptr), (u32_t)(size));                        \
        if (st != STATUS_OK) {                                                      \
            return st;                                                              \
        }                                                                           \
    } while (0)

    NVS_APPEND_U32(NVS_CFG_NS_DEV, NVS_CFG_KEY_SCHEMA, s_cfg.schema_version);
    NVS_APPEND_U32(NVS_CFG_NS_DEV, NVS_CFG_KEY_HW_REV, s_cfg.hw_rev);
    NVS_APPEND_U32(NVS_CFG_NS_DEV, NVS_CFG_KEY_BOOT_CNT, s_cfg.boot_count);
    if (serial_len > 0U) {
        NVS_APPEND_BLOB(NVS_CFG_NS_DEV, NVS_CFG_KEY_SERIAL, s_cfg.serial, serial_len);
    }
    {
        size_t fw_len = strlen(s_cfg.fw_version);

        if (fw_len > 0U) {
            NVS_APPEND_BLOB(NVS_CFG_NS_DEV, NVS_CFG_KEY_FW_VER, s_cfg.fw_version, fw_len + 1U);
        }
    }
    NVS_APPEND_BLOB(NVS_CFG_NS_CTRL, NVS_CFG_KEY_SPD_LIM, &s_cfg.spd_limit,
                    sizeof(s_cfg.spd_limit));
    NVS_APPEND_BLOB(NVS_CFG_NS_CTRL, NVS_CFG_KEY_KINEM, &s_cfg.kinematics,
                    sizeof(s_cfg.kinematics));
    NVS_APPEND_U32(NVS_CFG_NS_CTRL, NVS_CFG_KEY_MOT_DIR, s_cfg.motor_dir_mask);
    NVS_APPEND_U32(NVS_CFG_NS_CTRL, NVS_CFG_KEY_ENC_DIR, s_cfg.encoder_dir_mask);
    NVS_APPEND_BLOB(NVS_CFG_NS_CAL, NVS_CFG_KEY_IMU_OFF, &s_cfg.imu_offset,
                    sizeof(s_cfg.imu_offset));
    NVS_APPEND_BLOB(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_TH, &s_cfg.line_threshold,
                    sizeof(s_cfg.line_threshold));
    NVS_APPEND_U32(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_POL, (u32_t)s_cfg.line_black_active_high);
    NVS_APPEND_BLOB(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_BASE, &s_cfg.line_base_rpm,
                    sizeof(s_cfg.line_base_rpm));
    NVS_APPEND_BLOB(NVS_CFG_NS_CAL, NVS_CFG_KEY_ENC_ZERO, &s_cfg.encoder_zero,
                    sizeof(s_cfg.encoder_zero));
    NVS_APPEND_BLOB(NVS_CFG_NS_CAL, NVS_CFG_KEY_BAT_CAL, &s_cfg.battery_cal,
                    sizeof(s_cfg.battery_cal));
    NVS_APPEND_BLOB(NVS_CFG_NS_CAL, NVS_CFG_KEY_MAG_HDG, &s_cfg.mag_heading_offset_deg,
                    sizeof(s_cfg.mag_heading_offset_deg));
    NVS_APPEND_U32(NVS_CFG_NS_USER, NVS_CFG_KEY_LAST_MODE, (u32_t)s_cfg.last_mode);

#undef NVS_APPEND_U32
#undef NVS_APPEND_BLOB

    return nvs_commit_page_payload(s_nvs_payload, len);
}

static void nvs_dev_fill_serial(char *serial, size_t size)
{
    static const char k_hex[] = "0123456789ABCDEF";
    u32_t did0 = HWREG(SYSCTL_DID0);
    u32_t did1 = HWREG(SYSCTL_DID1);
    char tmp[13];
    u32_t val;
    int i;

    if ((serial == NULL) || (size == 0U)) {
        return;
    }

    val = did1;
    for (i = 7; i >= 0; i--) {
        tmp[i] = k_hex[val & 0xFU];
        val >>= 4;
    }

    val = did0 & 0xFFFFU;
    for (i = 11; i >= 8; i--) {
        tmp[i] = k_hex[val & 0xFU];
        val >>= 4;
    }
    tmp[12] = '\0';

    (void)memcpy(serial, tmp, 13U);
    serial[size - 1U] = '\0';
}

static void nvs_cfg_detect_first_boot(void)
{
    u32_t schema = 0U;

    if (nvs_get_u32_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_SCHEMA, &schema) != STATUS_OK) {
        s_first_boot = 1;
    }
}

static void nvs_cfg_ensure_serial(void)
{
    size_t len;

    if (s_cfg.serial[0] != '\0') {
        return;
    }

    nvs_dev_fill_serial(s_cfg.serial, sizeof(s_cfg.serial));
    len = strlen(s_cfg.serial);
    if (len == 0U) {
        return;
    }

