indexxue/TM4C123GH6PM/Common/src/nvs.c
    (void)nvs_set_blob_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_SERIAL, s_cfg.serial, (u32_t)len);
}

static status_t nvs_cfg_seed_if_needed(void)
{
    u32_t schema = 0U;
    status_t st;

    if (nvs_get_u32_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_SCHEMA, &schema) == STATUS_OK) {
        return STATUS_OK;
    }

    s_first_boot = 1;
    st = nvs_cfg_persist_defaults();
    if (st != STATUS_OK) {
        return st;
    }

    return STATUS_OK;
}

static void nvs_cfg_load_from_flash(nvs_cfg_t *cfg)
{
    u32_t u32_val;
    char serial[NVS_CFG_SERIAL_MAX];
    u32_t serial_len = sizeof(serial);

    if (nvs_get_u32_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_SCHEMA, &u32_val) == STATUS_OK) {
        cfg->schema_version = u32_val;
    }

    if (nvs_get_blob_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_SERIAL, serial, &serial_len) == STATUS_OK) {
        if ((serial_len > 0U) && (serial_len < NVS_CFG_SERIAL_MAX)) {
            (void)memcpy(cfg->serial, serial, serial_len);
            cfg->serial[serial_len] = '\0';
        }
    }

    if (nvs_get_u32_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_HW_REV, &u32_val) == STATUS_OK) {
        cfg->hw_rev = u32_val;
    }

    if (nvs_get_u32_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_BOOT_CNT, &u32_val) == STATUS_OK) {
        cfg->boot_count = u32_val;
    }

    {
        char fw_ver[NVS_CFG_FW_VER_MAX];
        u32_t fw_ver_len = sizeof(fw_ver);

        if (nvs_get_blob_impl(NVS_CFG_NS_DEV, NVS_CFG_KEY_FW_VER, fw_ver, &fw_ver_len) == STATUS_OK) {
            if (fw_ver_len > 0U) {
                u32_t copy = fw_ver_len;

                if (copy >= NVS_CFG_FW_VER_MAX) {
                    copy = NVS_CFG_FW_VER_MAX - 1U;
                }
                (void)memcpy(cfg->fw_version, fw_ver, copy);
                cfg->fw_version[copy] = '\0';
            }
        }
    }

    if (nvs_load_blob_exact(NVS_CFG_NS_CTRL, NVS_CFG_KEY_SPD_LIM, &cfg->spd_limit,
                            (u32_t)sizeof(cfg->spd_limit)) == 0) {
        /* keep default */
    }

    if (nvs_load_blob_exact(NVS_CFG_NS_CTRL, NVS_CFG_KEY_KINEM, &cfg->kinematics,
                            (u32_t)sizeof(cfg->kinematics)) == 0) {
        /* keep default */
    }

    if (nvs_get_u32_impl(NVS_CFG_NS_CTRL, NVS_CFG_KEY_MOT_DIR, &u32_val) == STATUS_OK) {
        cfg->motor_dir_mask = u32_val;
    }

    if (nvs_get_u32_impl(NVS_CFG_NS_CTRL, NVS_CFG_KEY_ENC_DIR, &u32_val) == STATUS_OK) {
        cfg->encoder_dir_mask = u32_val;
    }

    nvs_cfg_reconcile_motor_dir(cfg);
    nvs_cfg_reconcile_encoder_dir(cfg);

    if (nvs_load_blob_exact(NVS_CFG_NS_CAL, NVS_CFG_KEY_IMU_OFF, &cfg->imu_offset,
                            (u32_t)sizeof(cfg->imu_offset)) == 0) {
        /* keep default */
    }

    if (nvs_load_blob_exact(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_TH, &cfg->line_threshold,
                            (u32_t)sizeof(cfg->line_threshold)) == 0) {
        /* keep default */
    }

    if (nvs_get_u32_impl(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_POL, &u32_val) == STATUS_OK) {
        cfg->line_black_active_high = (u8_t)((u32_val != 0U) ? 1U : 0U);
    }

    if (nvs_load_blob_exact(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_BASE, &cfg->line_base_rpm,
                            (u32_t)sizeof(cfg->line_base_rpm)) == 0) {
        /* keep default */
    }

    if (nvs_load_blob_exact(NVS_CFG_NS_CAL, NVS_CFG_KEY_ENC_ZERO, &cfg->encoder_zero,
                            (u32_t)sizeof(cfg->encoder_zero)) == 0) {
        /* keep default */
    }

    if (nvs_load_blob_exact(NVS_CFG_NS_CAL, NVS_CFG_KEY_BAT_CAL, &cfg->battery_cal,
                            (u32_t)sizeof(cfg->battery_cal)) == 0) {
        /* keep default */
    }

    if (nvs_load_blob_exact(NVS_CFG_NS_CAL, NVS_CFG_KEY_MAG_HDG, &cfg->mag_heading_offset_deg,
                            (u32_t)sizeof(cfg->mag_heading_offset_deg)) == 0) {
        /* keep default */
    }

    if (nvs_get_u32_impl(NVS_CFG_NS_USER, NVS_CFG_KEY_LAST_MODE, &u32_val) == STATUS_OK) {
        if (u32_val <= (u32_t)NVS_RUN_MODE_REMOTE) {
            cfg->last_mode = (nvs_run_mode_t)u32_val;
        }
    }
}

const nvs_cfg_t *nvs_cfg_get(void)
{
    return &s_cfg;
}

bool nvs_first_boot(void)
{
    return (s_first_boot != 0);
}

/* -------------------------------------------------------------------------- */
/* 参数访问策略                                                                 */
/* -------------------------------------------------------------------------- */

static status_t nvs_param_check_write(nvs_param_id_t id, nvs_write_src_t src)
{
    u8_t bit;

    if (id >= NVS_PARAM_COUNT) {
        return STATUS_INVALID_ARG;
    }
    if (src > NVS_WRITE_SRC_INTERNAL) {
        return STATUS_INVALID_ARG;
    }

    bit = (u8_t)(1U << (u32_t)src);
    if ((s_param_policy[id].write_mask & bit) == 0U) {
        return STATUS_NOT_SUPPORTED;
    }

    return STATUS_OK;
}

bool nvs_param_write_allowed(nvs_param_id_t id, nvs_write_src_t src)
{
    return (nvs_param_check_write(id, src) == STATUS_OK);
}

static status_t nvs_param_persist_blob(nvs_param_id_t id, const char *ns, const char *key,
                                       const void *data, u32_t len)
{
    status_t st;

    if (!s_param_policy[id].persist) {
        return STATUS_OK;
    }

    nvs_lock();
    st = nvs_set_blob_impl(ns, key, data, len);
    nvs_unlock();
    return st;
}

static status_t nvs_param_persist_u32(nvs_param_id_t id, const char *ns, const char *key, u32_t value)
{
    status_t st;

    if (!s_param_policy[id].persist) {
        return STATUS_OK;
    }

    nvs_lock();
    st = nvs_set_blob_impl(ns, key, &value, (u32_t)sizeof(value));
    nvs_unlock();
    return st;
}

status_t nvs_param_set_serial(const char *serial, nvs_write_src_t src)
{
    size_t len;
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_SERIAL, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (serial == NULL) {
        return STATUS_INVALID_ARG;
    }

    len = strlen(serial);
    if ((len == 0U) || (len >= NVS_CFG_SERIAL_MAX)) {
        return STATUS_INVALID_ARG;
    }

