indexxue/TM4C123GH6PM/Common/src/nvs.c
    (void)memcpy(s_cfg.serial, serial, len + 1U);
    return nvs_param_persist_blob(NVS_PARAM_SERIAL, NVS_CFG_NS_DEV, NVS_CFG_KEY_SERIAL, serial,
                                  (u32_t)len);
}

status_t nvs_param_set_hw_rev(u32_t hw_rev, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_HW_REV, src);
    if (st != STATUS_OK) {
        return st;
    }

    s_cfg.hw_rev = hw_rev;
    return nvs_param_persist_u32(NVS_PARAM_HW_REV, NVS_CFG_NS_DEV, NVS_CFG_KEY_HW_REV, hw_rev);
}

status_t nvs_param_set_fw_version(const char *version, nvs_write_src_t src)
{
    size_t len;
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_FW_VERSION, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (version == NULL) {
        return STATUS_INVALID_ARG;
    }

    len = strlen(version);
    if (len >= NVS_CFG_FW_VER_MAX) {
        return STATUS_INVALID_ARG;
    }

    (void)memcpy(s_cfg.fw_version, version, len + 1U);
    if (len == 0U) {
        return nvs_param_persist_blob(NVS_PARAM_FW_VERSION, NVS_CFG_NS_DEV, NVS_CFG_KEY_FW_VER, "",
                                      0U);
    }

    /* 含结尾 '\0'，便于上位机/工具按 C 字符串读取 */
    return nvs_param_persist_blob(NVS_PARAM_FW_VERSION, NVS_CFG_NS_DEV, NVS_CFG_KEY_FW_VER, version,
                                  (u32_t)(len + 1U));
}

status_t nvs_param_inc_boot_count(void)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_BOOT_COUNT, NVS_WRITE_SRC_INTERNAL);
    if (st != STATUS_OK) {
        return st;
    }

    if (s_cfg.boot_count < UINT32_MAX) {
        s_cfg.boot_count++;
    }

    return nvs_param_persist_u32(NVS_PARAM_BOOT_COUNT, NVS_CFG_NS_DEV, NVS_CFG_KEY_BOOT_CNT,
                                 s_cfg.boot_count);
}

status_t nvs_param_set_pid_speed(const nvs_pid3_t *pid, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_PID_SPEED, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (pid == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.pid_speed = *pid;
    return STATUS_OK;
}

status_t nvs_param_set_pid_line(const nvs_pid3_t *pid, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_PID_LINE, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (pid == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.pid_line = *pid;
    return STATUS_OK;
}

status_t nvs_param_set_pid_yaw(const nvs_pid3_t *pid, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_PID_YAW, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (pid == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.pid_yaw = *pid;
    return STATUS_OK;
}

status_t nvs_param_set_pid_dist(const nvs_pid3_t *pid, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_PID_DIST, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (pid == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.pid_dist = *pid;
    return STATUS_OK;
}

status_t nvs_param_set_spd_limit(const nvs_spd_limit_t *limit, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_SPD_LIMIT, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (limit == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.spd_limit = *limit;
    return nvs_param_persist_blob(NVS_PARAM_SPD_LIMIT, NVS_CFG_NS_CTRL, NVS_CFG_KEY_SPD_LIM, limit,
                                  sizeof(*limit));
}

status_t nvs_param_set_kinematics(const nvs_kinematics_t *kinem, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_KINEMATICS, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (kinem == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.kinematics = *kinem;
    return nvs_param_persist_blob(NVS_PARAM_KINEMATICS, NVS_CFG_NS_CTRL, NVS_CFG_KEY_KINEM, kinem,
                                  sizeof(*kinem));
}

status_t nvs_param_set_motor_dir_mask(u32_t mask, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_MOTOR_DIR, src);
    if (st != STATUS_OK) {
        return st;
    }

    s_cfg.motor_dir_mask = mask;
    return nvs_param_persist_u32(NVS_PARAM_MOTOR_DIR, NVS_CFG_NS_CTRL, NVS_CFG_KEY_MOT_DIR, mask);
}

status_t nvs_param_set_encoder_dir_mask(u32_t mask, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_ENCODER_DIR, src);
    if (st != STATUS_OK) {
        return st;
    }

    s_cfg.encoder_dir_mask = mask & 0x0FU;
    return nvs_param_persist_u32(NVS_PARAM_ENCODER_DIR, NVS_CFG_NS_CTRL,
                                 NVS_CFG_KEY_ENC_DIR, s_cfg.encoder_dir_mask);
}

status_t nvs_param_set_imu_offset(const nvs_imu_offset_t *offset, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_IMU_OFFSET, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (offset == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.imu_offset = *offset;
    return nvs_param_persist_blob(NVS_PARAM_IMU_OFFSET, NVS_CFG_NS_CAL, NVS_CFG_KEY_IMU_OFF, offset,
                                  sizeof(*offset));
}

status_t nvs_param_set_line_threshold(const nvs_line_threshold_t *threshold, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_LINE_THRESHOLD, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (threshold == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.line_threshold = *threshold;
    return nvs_param_persist_blob(NVS_PARAM_LINE_THRESHOLD, NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_TH,
                                  threshold, sizeof(*threshold));
}

status_t nvs_param_set_line_polarity(u8_t black_active_high, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_LINE_POLARITY, src);
    if (st != STATUS_OK) {
        return st;
    }

    s_cfg.line_black_active_high = (black_active_high != 0U) ? 1U : 0U;
    return nvs_param_persist_u32(NVS_PARAM_LINE_POLARITY, NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_POL,
                                 (u32_t)s_cfg.line_black_active_high);
}

