indexxue/TM4C123GH6PM/Common/src/nvs.c
status_t nvs_param_set_line_base_rpm(f32_t base_rpm, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_LINE_BASE_RPM, src);
    if (st != STATUS_OK) {
        return st;
    }
    if ((base_rpm < 0.0f) || (base_rpm > 1200.0f)) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.line_base_rpm = base_rpm;
    return nvs_param_persist_blob(NVS_PARAM_LINE_BASE_RPM, NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_BASE,
                                  &s_cfg.line_base_rpm, (u32_t)sizeof(s_cfg.line_base_rpm));
}

status_t nvs_param_set_encoder_zero(const nvs_encoder_zero_t *zero, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_ENCODER_ZERO, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (zero == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.encoder_zero = *zero;
    return nvs_param_persist_blob(NVS_PARAM_ENCODER_ZERO, NVS_CFG_NS_CAL, NVS_CFG_KEY_ENC_ZERO, zero,
                                  sizeof(*zero));
}

status_t nvs_param_set_battery_cal(const nvs_battery_cal_t *cal, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_BATTERY_CAL, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (cal == NULL) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.battery_cal = *cal;
    return nvs_param_persist_blob(NVS_PARAM_BATTERY_CAL, NVS_CFG_NS_CAL, NVS_CFG_KEY_BAT_CAL, cal,
                                  sizeof(*cal));
}

status_t nvs_param_set_mag_heading_offset(f32_t offset_deg, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_MAG_HEADING, src);
    if (st != STATUS_OK) {
        return st;
    }

    s_cfg.mag_heading_offset_deg = offset_deg;
    return nvs_param_persist_blob(NVS_PARAM_MAG_HEADING, NVS_CFG_NS_CAL, NVS_CFG_KEY_MAG_HDG,
                                  &s_cfg.mag_heading_offset_deg,
                                  (u32_t)sizeof(s_cfg.mag_heading_offset_deg));
}

status_t nvs_param_set_last_mode(nvs_run_mode_t mode, nvs_write_src_t src)
{
    status_t st;

    st = nvs_param_check_write(NVS_PARAM_LAST_MODE, src);
    if (st != STATUS_OK) {
        return st;
    }
    if (mode > NVS_RUN_MODE_REMOTE) {
        return STATUS_INVALID_ARG;
    }

    s_cfg.last_mode = mode;
    return nvs_param_persist_u32(NVS_PARAM_LAST_MODE, NVS_CFG_NS_USER, NVS_CFG_KEY_LAST_MODE,
                                 (u32_t)mode);
}

status_t nvs_factory_reset(void)
{
    char serial[NVS_CFG_SERIAL_MAX];
    char fw_version[NVS_CFG_FW_VER_MAX];
    u32_t hw_rev;
    u32_t boot_count;
    status_t st;

    nvs_lock();

    (void)memcpy(serial, s_cfg.serial, sizeof(serial));
    (void)memcpy(fw_version, s_cfg.fw_version, sizeof(fw_version));
    hw_rev = s_cfg.hw_rev;
    boot_count = s_cfg.boot_count;

    nvs_cfg_apply_defaults(&s_cfg);

    (void)memcpy(s_cfg.serial, serial, sizeof(s_cfg.serial));
    (void)memcpy(s_cfg.fw_version, fw_version, sizeof(s_cfg.fw_version));
    s_cfg.hw_rev = hw_rev;
    s_cfg.boot_count = boot_count;

    st = nvs_set_blob_impl(NVS_CFG_NS_CTRL, NVS_CFG_KEY_SPD_LIM, &s_cfg.spd_limit,
                           (u32_t)sizeof(s_cfg.spd_limit));
    if (st != STATUS_OK) {
        goto done;
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_CTRL, NVS_CFG_KEY_KINEM, &s_cfg.kinematics,
                           (u32_t)sizeof(s_cfg.kinematics));
    if (st != STATUS_OK) {
        goto done;
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_CTRL, NVS_CFG_KEY_MOT_DIR, &s_cfg.motor_dir_mask,
                           (u32_t)sizeof(s_cfg.motor_dir_mask));
    if (st != STATUS_OK) {
        goto done;
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_CAL, NVS_CFG_KEY_IMU_OFF, &s_cfg.imu_offset,
                           (u32_t)sizeof(s_cfg.imu_offset));
    if (st != STATUS_OK) {
        goto done;
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_TH, &s_cfg.line_threshold,
                           (u32_t)sizeof(s_cfg.line_threshold));
    if (st != STATUS_OK) {
        goto done;
    }

    {
        u32_t pol = (u32_t)s_cfg.line_black_active_high;

        st = nvs_set_blob_impl(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_POL, &pol, (u32_t)sizeof(pol));
        if (st != STATUS_OK) {
            goto done;
        }
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_CAL, NVS_CFG_KEY_LINE_BASE, &s_cfg.line_base_rpm,
                           (u32_t)sizeof(s_cfg.line_base_rpm));
    if (st != STATUS_OK) {
        goto done;
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_CAL, NVS_CFG_KEY_ENC_ZERO, &s_cfg.encoder_zero,
                           (u32_t)sizeof(s_cfg.encoder_zero));
    if (st != STATUS_OK) {
        goto done;
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_CAL, NVS_CFG_KEY_BAT_CAL, &s_cfg.battery_cal,
                           (u32_t)sizeof(s_cfg.battery_cal));
    if (st != STATUS_OK) {
        goto done;
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_CAL, NVS_CFG_KEY_MAG_HDG, &s_cfg.mag_heading_offset_deg,
                           (u32_t)sizeof(s_cfg.mag_heading_offset_deg));
    if (st != STATUS_OK) {
        goto done;
    }

    st = nvs_set_blob_impl(NVS_CFG_NS_USER, NVS_CFG_KEY_LAST_MODE, &s_cfg.last_mode,
                           (u32_t)sizeof(s_cfg.last_mode));

done:
    nvs_unlock();
    return st;
}

status_t nvs_boot_slot_get(uint32_t *slot_out)
{
    if (slot_out == NULL) {
        return STATUS_INVALID_ARG;
    }

    *slot_out = boot_slot_read();
    return STATUS_OK;
}

status_t nvs_boot_slot_set(uint32_t slot)
{
    boot_slot_cfg_t *cfg;
    status_t st;
    uint32_t payload_len = 0U;

    if (slot > BOOT_SLOT_B) {
        return STATUS_INVALID_ARG;
    }

    nvs_lock();

    st = nvs_copy_active_kv_payload(s_nvs_payload, sizeof(s_nvs_payload), &payload_len);
    if (st != STATUS_OK) {
        nvs_unlock();
        return st;
    }

    {
        const uint8_t *active = (const uint8_t *)nvs_page_base(s_active_page);

        (void)memcpy(s_boot_rsvd_copy, active + NVS_BOOT_RSVD_OFFSET, NVS_BOOT_RSVD_SIZE);
    }

    cfg = (boot_slot_cfg_t *)s_boot_rsvd_copy;
    cfg->magic = BOOT_SLOT_MAGIC;
    cfg->slot = slot;

    s_boot_rsvd_override = 1;
    st = nvs_commit_page_payload(s_nvs_payload, payload_len);
    nvs_unlock();
    return st;
}
